package com.tfjt.pay.external.unionpay.enums.digital;

import lombok.Getter;

/**
 * 数字人民币交易错误码
 * @author songx
 * @Date: 2023/11/29/09:59
 */
@Getter
public enum DigitalErrorCodeEnum {
    /**
     * 限制交易流量
     */
    R001("R001", "限制交易流量"),
    /**
     * 系统定时维护
     */
    R002("R002", "系统定时维护"),
    /**
     * 系统临时维护
     */
    R003("R003", "系统临时维护"),
    /**
     * 请求非法
     */
    R004("R004", "请求非法"),
    /**
     * 请求报文格式有误
     */
    R005("R005", "请求报文格式有误"),
    /**
     * 请求报文必填参数缺失
     */
    R006("R006", "请求报文必填参数缺失"),
    /**
     * 请求报文参数有误
     */
    R007("R007", "请求报文参数有误"),
    /**
     * 请求报文字段长度超限
     */
    R008("R008", "请求报文字段长度超限"),
    /**
     * 核数字签名错
     */
    R009("R009", "核数字签名错"),
    /**
     * 敏感字段解密失败
     */
    R010("R010", "敏感字段解密失败"),
    /**
     * 账户不存在
     */
    R021("R021", "账户不存在"),
    /**
     * 账号、 户名不符
     */
    R022("R022", "账号、 户名不符"),
    /**
     * 账户余额不足支付
     */
    R023("R023", "账户余额不足支付"),
    /**
     * 账户类型错
     */
    R024("R024", "账户类型错"),
    /**
     * 支付密码错
     */
    R025("R025", "支付密码错"),
    /**
     * 输入支付密码次数超限
     */
    R026("R026", "输入支付密码次数超限"),
    /**
     * 没收卡
     */
    R027("R027", "没收卡"),
    /**
     * 过期卡
     */
    R028("R028", "过期卡"),
    /**
     * 受限制卡
     */
    R029("R029", "受限制卡"),
    /**
     * 已挂失
     */
    R030("R030", "已挂失"),
    /**
     * 被窃卡
     */
    R031("R031", "被窃卡"),
    /**
     * 已冻结
     */
    R032("R032", "已冻结"),
    /**
     * 已清户
     */
    R033("R033", "已清户"),
    /**
     * 账户状态异常
     */
    R034("R034", "账户状态异常"),
    /**
     * 账户不支待此类交易
     */
    R035("R035", "账户不支待此类交易"),
    /**
     * 身份证件类型错误
     */
    R036("R036", "身份证件类型错误"),
    /**
     * 身份证件号码错误
     */
    R037("R037", "身份证件号码错误"),
    /**
     * 指定协议不存在
     */
    R038("R038", "指定协议不存在"),
    /**
     * 超过协议授权范围
     */
    R039("R039", "超过协议授权范围"),
    /**
     * 重复签约
     */
    R040("R040", "重复签约"),
    /**
     * 协议状态有误
     */
    R041("R041", "协议状态有误"),
    /**
     * 核验身份错误
     */
    R042("R042", "核验身份错误"),
    /**
     * 当日业务累计金额超过规定金额
     */
    R043("R043", "当日业务累计金额超过规定金额"),
    /**
     * 原交易不存在
     */
    R044("R044", "原交易不存在"),
    /**
     * 超过约定限额或笔数
     */
    R045("R045", "超过约定限额或笔数"),
    /**
     * 原交易不成功
     */
    R046("R046", "原交易不成功"),
    /**
     * 业务检查错
     */
    R047("R047", "业务检查错"),
    /**
     * 日期错误
     */
    R048("R048", "日期错误"),
    /**
     * 报文标识号非法
     */
    R049("R049", "报文标识号非法"),
    /**
     * 重复交易
     */
    R050("R050", "重复交易"),
    /**
     * 账户为 II 类户，超出业务范围
     */
    R051("R051", "账户为 II 类户，超出业务范围"),
    /**
     * 账户为 III 类户， 超出业务范围
     */
    R052("R052", "账户为 III 类户， 超出业务范围"),
    /**
     * 账户为 II 类户，超出限定金额
     */
    R053("R053", "账户为 II 类户，超出限定金额"),
    /**
     * 账户为 III 类户，超出限定金额
     */
    R054("R054", "账户为 III 类户，超出限定金额"),
    /**
     * 付款账户状态异常
     */
    R055("R055", "付款账户状态异常"),
    /**
     * 收款账户状态异常
     */
    R056("R056", "收款账户状态异常"),
    /**
     * 不支持的证件类型
     */
    R057("R057", "不支持的证件类型"),
    /**
     * 未预留手机号码
     */
    R058("R058", "未预留手机号码"),
    /**
     * 手机号码错误
     */
    R059("R059", "手机号码错误"),
    /**
     * 短信验证码错误
     */
    R060("R060", "短信验证码错误"),
    /**
     * 身份证件已经被使用
     */
    R061("R061", "身份证件已经被使用"),
    /**
     * 查询时间跨度太大
     */
    R062("R062", "查询时间跨度太大"),
    /**
     * 超过单月限额
     */
    R063("R063", "超过单月限额"),
    /**
     * 未开通短信通知服务
     */
    R064("R064", "未开通短信通知服务"),
    /**
     * 超过提示付款期
     */
    R065("R065", "超过提示付款期"),
    /**
     * 重复提示付款
     */
    R066("R066", "重复提示付款"),
    /**
     * 动态验证信息已过期
     */
    R067("R067", "动态验证信息已过期"),
    /**
     * 尚未开通消费支付功能
     */
    R068("R068", "尚未开通消费支付功能"),
    /**
     * 黑名单账户
     */
    R069("R069", "黑名单账户"),
    /**
     * 签约失败次数超限
     */
    R070("R070", "签约失败次数超限"),
    /**
     * 协议已解约
     */
    R071("R071", "协议已解约"),
    /**
     * 账户因未缴纳管理费而不可用
     */
    R072("R072", "账户因未缴纳管理费而不可用"),
    /**
     * 交易币种不支待
     */
    R073("R073", "交易币种不支待"),
    /**
     * 其他因风险控制导致的交易失败
     */
    R074("R074", "其他因风险控制导致的交易失败"),
    /**
     * 签约协议已过期
     */
    R075("R075", "签约协议已过期"),
    /**
     * 账户当日交易次数超限
     */
    R076("R076", "账户当日交易次数超限"),
    /**
     * 账户当日业务累计金额超限
     */
    R077("R077", "账户当日业务累计金额超限"),
    /**
     * 账户当月交易次数超限
     */
    R078("R078", "账户当月交易次数超限"),
    /**
     * 账户当月业务累计金额超限
     */
    R079("R079", "账户当月业务累计金额超限"),
    /**
     * 账户当年交易次数超限
     */
    R080("R080", "账户当年交易次数超限"),
    /**
     * 账户当年业务累计金额超限
     */
    R081("R081", "账户当年业务累计金额超限"),
    /**
     * 原交易不允许退款
     */
    R082("R082", "原交易不允许退款"),
    /**
     * 退款累计金额超限
     */
    R083("R083", "退款累计金额超限"),
    /**
     * 退款日期已超限
     */
    R084("R084", "退款日期已超限"),
    /**
     * 原支付交易已成功退款
     */
    R085("R085", "原支付交易已成功退款"),
    /**
     * 此账户类型不支持此类交易
     */
    R086("R086", "此账户类型不支持此类交易"),
    /**
     * 非个人客户
     */
    R087("R087", "非个人客户"),
    /**
     * 客户为银行黑名单客户或因风控原因拒绝交易
     */
    R088("R088", "客户为银行黑名单客户或因风控原因拒绝交易"),
    /**
     * 银行暂不支持的交易类型
     */
    R089("R089", "银行暂不支持的交易类型"),
    /**
     * 非当前交易类型办理时间
     */
    R090("R090", "非当前交易类型办理时间"),
    /**
     * 暂停非柜面交易， 请至柜台办理
     */
    R091("R091", "暂停非柜面交易， 请至柜台办理"),
    /**
     * 签约人账户状态为暂时禁用
     */
    R092("R092", "签约人账户状态为暂时禁用"),
    /**
     * 签约人账户名称与账户号码不一致
     */
    R093("R093", "签约人账户名称与账户号码不一致"),
    /**
     * 签约人四要素信息与签约行记录不符
     */
    R094("R094", "签约人四要素信息与签约行记录不符"),
    /**
     * 签约人账号请求次数超过签约行限制
     */
    R095("R095", "签约人账号请求次数超过签约行限制"),
    /**
     * 动态验证码错误次数超过签约行限制
     */
    R096("R096", "动态验证码错误次数超过签约行限制"),
    /**
     * 账户开启安全锁， 阻断签约
     */
    R097("R097", "账户开启安全锁， 阻断签约"),
    /**
     * 签约人账户状态异常
     */
    R098("R098", "签约人账户状态异常"),
    /**
     * 解约申请信息与签约行记录不一致
     */
    R099("R099", "解约申请信息与签约行记录不一致"),
    /**
     * 收款账户余额超限
     */
    R100("R100", "收款账户余额超限"),
    /**
     * 付款账户可用余额不足且重试次数超过付款行限制
     */
    R101("R101", "付款账户可用余额不足且重试次数超过付款行限制"),
    /**
     * 款金额等于本金金额， 需结清
     */
    R102("R102", "款金额等于本金金额， 需结清"),
    /**
     * 退款申请信息与原交易信息不一致
     */
    R103("R103", "退款申请信息与原交易信息不一致"),
    /**
     * 原交易退款次数超过银行限制， 不允许退款
     */
    R104("R104", "原交易退款次数超过银行限制， 不允许退款"),
    /**
     * 钱包 ID 不存在
     */
    R105("R105", "钱包 ID 不存在"),
    /**
     * 钱包余额不足
     */
    R106("R106", "钱包余额不足"),
    /**
     * 钱包类型错
     */
    R107("R107", "钱包类型错"),
    /**
     * 钱包等级错
     */
    R108("R108", "钱包等级错"),
    /**
     * 等待用户付款
     */
    R109("R109", "等待用户付款"),
    /**
     * 消费付款码无效
     */
    R110("R110", "消费付款码无效"),
    /**
     * 无效商户
     */
    R111("R111", "无效商户"),
    /**
     * 订单总金额超过限额
     */
    R112("R112", "订单总金额超过限额"),
    /**
     * 买家与卖家不能相同
     */
    R113("R113", "买家与卖家不能相同"),
    /**
     * 交易买家不匹配
     */
    R114("R114", "交易买家不匹配"),
    /**
     * 买家状态非法
     */
    R115("R115", "买家状态非法"),
    /**
     * 钱包状态异常
     */
    R116("R116", "钱包状态异常"),
    /**
     * 验证码发送失败
     */
    R117("R117", "验证码发送失败"),
    /**
     * 验证码发送请求过千频繁
     */
    R118("R118", "验证码发送请求过千频繁"),
    /**
     * 钱包消息推送目标钱包信息错误
     */
    R119("R119", "钱包消息推送目标钱包信息错误"),
    /**
     * 钱包消息推送失败
     */
    R120("R120", "钱包消息推送失败"),
    /**
     * 验证码不存在或已过期
     */
    R121("R121", "验证码不存在或已过期"),
    /**
     * 未查询到二维码信息
     */
    R122("R122", "未查询到二维码信息"),
    /**
     * 收款人钱包 ID 与收款人名称不符
     */
    R123("R123", "收款人钱包 ID 与收款人名称不符"),
    /**
     * 收款人钱包 ID 与收款人钱包名称不符
     */
    R124("R124", "收款人钱包 ID 与收款人钱包名称不符"),
    /**
     * 原交易状态不支持差错调账
     */
    R125("R125", "原交易状态不支持差错调账"),
    /**
     * 原交易不支持差错调账
     */
    R126("R126", "原交易不支持差错调账"),
    /**
     * 差错贷记调账失败
     */
    R127("R127", "差错贷记调账失败"),
    /**
     * 客户不在白名单中
     */
    R128("R128", "客户不在白名单中"),
    /**
     * 推送商户账号不存在
     */
    R130("R130", "推送商户账号不存在"),
    /**
     * 密码输入错误（还剩 X 次）
     */
    R131("R131", "密码输入错误（还剩 X 次）"),
    /**
     * 密码输入错误次数超限
     */
    R132("R132", "密码输入错误次数超限"),
    /**
     * 子钱包重复开立
     */
    R133("R133", "子钱包重复开立"),
    /**
     * 身份证件过期
     */
    R134("R134", "身份证件过期"),
    /**
     * 额度注销失败
     */
    R135("R135", "额度注销失败"),
    /**
     * 图像无法解析
     */
    R136("R136", "图像无法解析"),
    /**
     * 人像识别失败
     */
    R137("R137", "人像识别失败"),
    /**
     * 人像和身份信息不匹配
     */
    R138("R138", "人像和身份信息不匹配"),
    /**
     * 映射码不存在或已过期
     */
    R139("R139", "映射码不存在或已过期"),
    /**
     * 无可用的银行卡列表
     */
    R140("R140", "无可用的银行卡列表"),
    /**
     * 订单不存在或已过期
     */
    R141("R141", "订单不存在或已过期"),
    /**
     * 订单信息校验失败
     */
    R142("R142", "订单信息校验失败"),
    /**
     * 单笔支付金额超限
     */
    R143("R143", "单笔支付金额超限"),
    /**
     * 订单重复支付
     */
    R144("R144", "订单重复支付"),
    /**
     * 订单状态错误
     */
    R145("R145", "订单状态错误"),
    /**
     * 商户只支待推送一个子钱包
     */
    R146("R146", "商户只支待推送一个子钱包"),
    /**
     * 清算账户可用余额不足
     */
    R147("R147", "清算账户可用余额不足"),
    /**
     * 商户无此接口权限
     */
    R148("R148", "商户无此接口权限"),
    /**
     * 商户订单已支付
     */
    R149("R149", "商户订单已支付"),
    /**
     * 商户订单号重复
     */
    R150("R150", "商户订单号重复"),
    /**
     * 订单己关闭
     */
    R151("R151", "订单己关闭"),
    /**
     * 商户不存在
     */
    R152("R152", "商户不存在"),
    /**
     * 商户状态异常
     */
    R153("R153", "商户状态异常"),
    /**
     * 订单等待支付， 暂时无法退款， 请稍后再试
     */
    R154("R154", "订单等待支付， 暂时无法退款， 请稍后再试"),
    /**
     * 订单支付成功， 不能发起关单
     */
    R155("R155", "订单支付成功， 不能发起关单"),
    /**
     * 订单支付失败， 不能发起关单
     */
    R156("R156", "订单支付失败， 不能发起关单"),
    /**
     * 订单信息中包含违禁词
     */
    R157("R157", "订单信息中包含违禁词"),
    /**
     * 订单总金额超过限额
     */
    R158("R158", "订单总金额超过限额"),
    /**
     * 交易信息被篡改
     */
    R159("R159", "交易信息被篡改"),
    /**
     * 交易已经关闭
     */
    R160("R160", "交易已经关闭"),
    /**
     * 买卖家不能相同
     */
    R161("R161", "买卖家不能相同"),
    /**
     * 买卖状态非法
     */
    R162("R162", "买卖状态非法"),
    /**
     * 唤起移动收银台失败
     */
    R163("R163", "唤起移动收银台失败"),
    /**
     * 支付失败
     */
    R164("R164", "支付失败"),
    /**
     * 买家付款日限额超限
     */
    R165("R165", "买家付款日限额超限"),
    /**
     * 商户收款额度超限
     */
    R166("R166", "商户收款额度超限"),
    /**
     * 商户收款金额超过月限额
     */
    R167("R167", "商户收款金额超过月限额"),
    /**
     * 买家付款月额度超限
     */
    R168("R168", "买家付款月额度超限"),
    /**
     * 商家账号被冻结
     */
    R169("R169", "商家账号被冻结"),
    /**
     * 支付有风险
     */
    R170("R170", "支付有风险"),
    /**
     * 商户协议已失效
     */
    R171("R171", "商户协议已失效"),
    /**
     * 商户协议状态非正常状态
     */
    R172("R172", "商户协议状态非正常状态"),
    /**
     * 订单金额或币种信息错误
     */
    R173("R173", "订单金额或币种信息错误"),
    /**
     * 订单币种不支待
     */
    R174("R174", "订单币种不支待"),
    /**
     * 交易退款金额有误
     */
    R175("R175", "交易退款金额有误"),
    /**
     * 交易状态不合法
     */
    R176("R176", "交易状态不合法"),
    /**
     * 机构信息不存在
     */
    R177("R177", "机构信息不存在"),
    /**
     * 支付结果未知
     */
    R178("R178", "支付结果未知"),
    /**
     * 商户无权限
     */
    R179("R179", "商户无权限"),
    /**
     * 二维码已过期， 请用户刷新后再试
     */
    R180("R180", "二维码已过期， 请用户刷新后再试"),
    /**
     * 钱柜资金调增失败
     */
    R181("R181", "钱柜资金调增失败"),
    /**
     * 钱柜资金调减失败
     */
    R182("R182", "钱柜资金调减失败"),
    /**
     * 商户侧账号未实名认证
     */
    R183("R183", "商户侧账号未实名认证"),
    /**
     * 订单支付中，请勿重复支付
     */
    R184("R184", "订单支付中，请勿重复支付"),
    /**
     * 订单号不存在
     */
    R185("R185", "订单号不存在"),
    /**
     * 参数包含敏感词
     */
    R186("R186", "参数包含敏感词"),
    /**
     * 该自然人已存在该类钱包，无法提升限额
     */
    R187("R187", "该自然人已存在该类钱包，无法提升限额"),
    /**
     * 银行卡验证成功， 绑定失败
     */
    R188("R188", "银行卡验证成功， 绑定失败"),
    /**
     * 银行卡开卡的最小天数限制校验失败
     */
    R189("R189", "银行卡开卡的最小天数限制校验失败"),
    /**
     * 身份证件号码已过期
     */
    R190("R190", "身份证件号码已过期"),
    /**
     * 银行卡预留手机号与 App 账号不一致
     */
    R191("R191", "银行卡预留手机号与 App 账号不一致"),
    /**
     * 暂不支持 16 周岁以下居民办理本业务
     */
    R192("R192", "暂不支持 16 周岁以下居民办理本业务"),
    /**
     * 银行卡预留实名信息与钱包实名信息不符
     */
    R193("R193", "银行卡预留实名信息与钱包实名信息不符"),
    /**
     * 用户关闭手机号转钱功能
     */
    R194("R194", "用户关闭手机号转钱功能"),
    /**
     * 银行卡预留证件信息与钱包证件信息不符
     */
    R195("R195", "银行卡预留证件信息与钱包证件信息不符"),
    /**
     * 银行卡预留实名信息与钱包实名信息不符
     */
    R196("R196", "银行卡预留实名信息与钱包实名信息不符"),
    /**
     * 当前钱包等级不支待绑定银行卡
     */
    R197("R197", "当前钱包等级不支待绑定银行卡"),
    /**
     * 钱柜 ID 不存在
     */
    R198("R198", "钱柜 ID 不存在"),
    /**
     * 钱柜余额不足
     */
    R199("R199", "钱柜余额不足"),
    /**
     * 手机号验证不一致
     */
    R200("R200", "手机号验证不一致"),
    /**
     * 实名信息验证不一致
     */
    R201("R201", "实名信息验证不一致"),
    /**
     * 手机号和实名信息验证不一致
     */
    R202("R202", "手机号和实名信息验证不一致"),
    /**
     * 非正常状态，不支持更新操作
     */
    R203("R203", "非正常状态，不支持更新操作"),
    /**
     * 该账户处千更新中，不支持此操作
     */
    R204("R204", "该账户处千更新中，不支持此操作"),
    /**
     * 账户不满足更新条件
     */
    R205("R205", "账户不满足更新条件"),
    /**
     * 银行卡预留手机号添加最小天数限制校验失败
     */
    R206("R206", "银行卡预留手机号添加最小天数限制校验失败"),
    /**
     * 业务金额与原金额不符
     */
    R207("R207", "业务金额与原金额不符"),
    /**
     * 超过免密额度需要支付密码
     */
    R208("R208", "超过免密额度需要支付密码"),
    /**
     * 硬钱包安全校验失败
     */
    R209("R209", "硬钱包安全校验失败"),
    /**
     * 活体检测验签失败
     */
    R210("R210", "活体检测验签失败"),
    /**
     * 当前钱包等级不支持该业务
     */
    R211("R211", "当前钱包等级不支持该业务"),
    /**
     * 钱包注销过于频繁
     */
    R212("R212", "钱包注销过于频繁"),
    /**
     * 锁定额度失败
     */
    R213("R213", "锁定额度失败"),
    /**
     * 锁定钱柜余额失败
     */
    R214("R214", "锁定钱柜余额失败"),
    /**
     * 密钥过期
     */
    R215("R215", "密钥过期"),
    /**
     * 解密失败
     */
    R216("R216", "解密失败"),
    /**
     * 钱包手机号已在运营机构关联其他实名信息
     */
    R217("R217", "钱包手机号已在运营机构关联其他实名信息"),
    /**
     * 该身份在运营机构存在多个客户号
     */
    R218("R218", "该身份在运营机构存在多个客户号"),
    /**
     * 风控导致的失败，需要联系运营机构核实
     */
    R219("R219", "风控导致的失败，需要联系运营机构核实"),
    /**
     * 风控导致的失败，运营机构核实后不支持用户使用
     */
    R220("R220", "风控导致的失败，运营机构核实后不支持用户使用"),
    /**
     * 该银行卡暂不支持添加到该钱包
     */
    R221("R221", "该银行卡暂不支持添加到该钱包"),
    /**
     * 银行卡暂不可用
     */
    R222("R222", "银行卡暂不可用"),
    /**
     * 机构自定义原因失败说明
     */
    R999("R999", "机构自定义原因失败说明");


    private String code;

    private String desc;

    DigitalErrorCodeEnum(String code, String desc) {
        this.code = code;
        this.desc = desc;
    }
}
